[
  {
    "date": "0772-02-28",
    "text": "公元772年，白居易出生于河南新郑市城关乡，父亲是白季庚，母亲是陈氏"
  },
  {
    "date": "0786-01-01",
    "text": "白居易14岁时，作《江南送北客因凭寄徐州兄弟书》。是目前史料明确可证的白居易最早传世作品。其作为一篇书信体诗文，仍保留唐代早期骈俪文风的影响"
  },
  {
    "date": "0790-01-01",
    "text": "白居易在18岁时遇见了湘灵，两人常常一起吟诗作对，彼此有着深厚的情感。然而，因门第差距，两人最终未能走到一起。\n这段初恋也成了白居易一生的遗憾，他的诗作中也常常隐约流露出对湘灵的怀念。"
  },
  {
    "date": "0798-01-01",
    "text": "公元798年，26岁的白居易前往宣州参加乡试，并在此期间，结识杨虞卿，后成白居易妻兄"
  },
  {
    "date": "0799-01-01",
    "text": "公元799年，27岁的白居易由宣州刺史崔衍送往长安应进士考试。在这一年里，创作了白居易流传最广的作品之一——《赋得古原草送别》，这首诗是唐代 \"赋得体\" 诗的巅峰之作，兼具应试规范与艺术高度。"
  },
  {
    "date": "0800-02-14",
    "text": "公元799年，白居易来到长安，参加了科举考试，凭借卓越的才学脱颖而出，以第四名的优异成绩中进士。这一年，白居易28岁。这一期间，白居易积极结识崔衍、唐衢等人，巩固仕途人脉。"
  },
  {
    "date": "0802-12-01",
    "text": "公元802年12月份，白居易通过书判拔萃科考试，入选吏部铨选。与他同年及第的还有元稹，白居易和元稹两人的友情也从此开始。"
  },
  {
    "date": "0803-04-01",
    "text": "公元803年，白居易担任校书郎一职，在此期间与元稹共同编订作《策林》75篇，提出\"核才实学\"等改革主张。"
  },
  {
    "date": "0805-01-01",
    "text": "唐宪宗在公元805年推行的一次政治改革，史称永贞革新。这场改革最终因为执行过于急功近利和政治环境复杂而导致失败。白居易因此写下《寓意诗五首》对这一政治局势进行批判，这标志着他文学创作中以政治讽刺和社会批评为主题的开端。"
  },
  {
    "date": "0806-01-01",
    "text": "公元806年，白居易任期届满，免去校书郎一职，并再次以乙等及第，随后被任命为周至县尉。也是在这一年，白居易创作了脍炙人口的《长恨歌》，这首诗融合道教传说与民间想象，描述了唐玄宗与杨贵妃的悲剧爱情故事，开创了 \"感伤叙事诗\" 新体。"
  },
  {
    "date": "0807-11-05",
    "text": "公元807年11月，35岁的白居易升迁授翰林学士，负责起草诏书、参议朝政，这标志白居易进入权力核心圈"
  },
  {
    "date": "0808-04-28",
    "text": "公元808年，白居易升迁左拾遗。年满36岁的白居易迎娶杨虞卿从妹为妻"
  },
  {
    "date": "0809-01-01",
    "text": "公元809年，白居易开始创作著名的《新乐府》五十首。他的弟弟白行简担任校书郎，元稹因弹劾权贵被贬，白居易作《酬和元九东川路诗》。"
  },
  {
    "date": "0810-01-01",
    "text": "公元810年，白居易多次上疏，抗议元稹被贬，未获回应。"
  },
  {
    "date": "0810-05-01",
    "text": "公元810这一年，白居易作《秦中吟十首》，揭露社会矛盾。同时与元稹频繁唱和，作《和答诗十首》《代书一百韵寄微之》，抒写对于元稹贬谪之愤。"
  },
  {
    "date": "0811-01-01",
    "text": "公元811年，白居易母亲陈氏去世，因服丧制度，回乡丁忧。这一年其独女金銮子早夭。丁忧三年白居易主要依靠元稹定期分俸资助以及崔群等友人接济。此年为白居易人生重要转折点，丁忧三年使其远离政治中心，其诗歌主题开始反思谏官生涯的徒劳，萌生归隐之念。"
  },
  {
    "date": "0812-01-01",
    "text": "公元812年，白居易开始农耕生活，诗歌风格渐少讽喻，多写田园隐逸"
  },
  {
    "date": "0813-01-01",
    "text": "公元813年，白居易虽服丧期满，但因曾得罪李吉甫等权贵，未被召回朝廷。"
  },
  {
    "date": "0814-12-01",
    "text": "公元814年12月，授太子左赞善大夫，结束丁忧闲居，重返朝廷，但所任官职并无实权。诗作题材广泛，既有讽喻民生之作，亦多山水酬唱之篇，反映其从积极谏政到淡然处世的过渡心态。"
  },
  {
    "date": "0815-06-01",
    "text": "公元815年，宰相武元衡遇刺身亡，白居易上表主张严缉凶手，被认为是越职言事，被贬为江州司马，即今江西九江。在这一年，白居易创作了大量诗歌，以感伤诗、闲适诗为主，并提出\"惟歌生民病，愿得天子知\"，标志白居易现实主义诗论成熟。元稹时任通州司马，二人诗书往来依旧。"
  },
  {
    "date": "0816-01-01",
    "text": "公元816年，白居易文学创作达到高峰，诗作《琵琶行》《访陶公旧宅》《四十五》等展现了他对人生的深刻感悟，并通过《夜雪》表达对盛世不再的惋惜，同时写《东南行一百韵》寄友，反映了宦海沉浮与个人情感的交织。尽管避谈政治，他依然通过诗歌隐晦地批评社会现状，展现出强烈的历史责任感与文学担当。"
  },
  {
    "date": "0817-04-09",
    "text": "公元817年，白居易来到庐山香炉峰与遗爱寺之间草堂。在这期间创作了《大林寺桃花》、《问刘十九》、《祭庐山文》等诗歌，展现了他在山水间的宁静与隐逸之心，并感悟生命与世事的无常。草堂成为他“中隐”思想的实践地，深刻影响了其后期选择隐居洛阳履道里的决定。"
  },
  {
    "date": "0818-12-01",
    "text": "公元818年，白居易在浔阳连生三女。弟白行简自东川至浔阳，兄弟团聚。818年12月，白居易升迁忠州刺史，结束四年贬谪生涯"
  },
  {
    "date": "0819-03-01",
    "text": "公元819年3月，白居易在三峡与元稹意外相遇，史称“夷陵之会”。"
  },
  {
    "date": "0819-03-28",
    "text": "公元819年，白居易在忠州刺史任内，关注民生，推广木莲种植并作《木莲树三首》，关心农事，作《征秋税毕题郡南亭》。他仿效巴蜀民俗，创作《竹枝词》，与百姓产生深厚情感。同时，白居易谨慎参与政事，保持对社会事务的关注，写下《东林寺经藏西廊记》《忠州刺史谢上表》等，反映其在地方治理中的理政理念。"
  },
  {
    "date": "0820-06-01",
    "text": "公元820年6月，白居易因治理忠州有方被重新起用，被召回长安，授尚书司门员外郎，虽然官职等级下降，但是实际上重新回到了权利中心"
  },
  {
    "date": "0820-12-01",
    "text": "公元820年12月升迁主客郎中，诗歌风格开始转向开始转向个人生活情趣"
  },
  {
    "date": "0821-04-01",
    "text": "公元821年4月，充重考试进士官，秉公复考，黜落十人。并通过诗文与元稹、韩愈互动"
  },
  {
    "date": "0821-10-01",
    "text": "公元821年10月升迁中书舍人，授上柱国虚衔，妻子杨氏封弘农郡君。在此期间作诗《寄山僧》、《自问》，流露出归隐之意"
  },
  {
    "date": "0822-01-01",
    "text": "公元822年1月，白居易上书论当时河北的军事，不被采用，于是请求到外地任职"
  },
  {
    "date": "0822-07-01",
    "text": "公元822年7月，牛李党争激化，白居易主动请辞中书舍人为杭州刺史，虽然官职等级上升，但实际远离权力中心。赴任诗作交织着对政坛的失望与对新任期的期待，诗风更趋平和，如《画竹歌》标志其艺术审美的新境界。"
  },
  {
    "date": "0823-01-01",
    "text": "公元823年，白居易在杭州任职，关注民生和地方治理，任内有修筑西湖堤防、疏浚六井等政绩，并在这一年留下大量诗作。他创作的《钱塘湖春行》、《杭州春望》等山水诗，描绘西湖春景，标志着其山水诗的巅峰。与元稹的“杭越唱和”成为中唐诗坛一大亮点。"
  },
  {
    "date": "0824-05-01",
    "text": "公元824年5月，白居易主动求任太子左庶子分司东都，此为洛阳闲职。元稹在浙东为其编成《白氏长庆集》，并作序，标志白居易诗歌首次系统结集。"
  },
  {
    "date": "0825-03-04",
    "text": "公元825年，白居易调任苏州刺史。他到任后迅速整顿吏治，减轻赋役，延续杭州时期的务实风格。作《苏州刺史谢上表》自谦政绩，并写《渡淮》《东城桂三首》《对酒吟》抒发个人情感与豁达胸襟。与常州刺史贾使君和刘禹锡诗文唱和，推动文人互动。其弟白行简升迁为主客郎中。"
  },
  {
    "date": "0826-10-01",
    "text": "公元826年10月因病去职，后与刘禹锡相伴游览于扬州、楚州一带，开启“刘白”晚年诗谊。"
  },
  {
    "date": "0826-12-01",
    "text": "公元826年冬季，白居易弟弟白行简卒，享年约五十岁，白居易失去最后至亲。"
  },
  {
    "date": "0827-01-01",
    "text": "公元827年，白居易至长安任秘书监。期间白居易撰写《三教论衡》，主张儒释道三教并重，体现其兼容并蓄的思想。并与裴度延续诗谊，创作《题兴化小池》。诗中流露出他从“兼济”到“闲适”的思想转型，展现了其内心的宁静与豁达"
  },
  {
    "date": "0828-02-01",
    "text": "公元828年，白居易转任刑部侍郎，主管全国司法。在此期间，白居易续编个人《文集》并作《后序》。与元稹合编唱和集《因继集》，作《因继集重序》。并为亡弟白行简整理《白郎中集》二十卷。并于与郎中刘禹锡、宰相崔群共赏花，邀国子司业张籍雨中论诗"
  },
  {
    "date": "0829-01-01",
    "text": "公元829年春，因病改授与太子宾客分司，回洛阳履道里。在此期间，编《刘白唱和集》，辑录与刘禹锡唱和诗百余首，树立了中唐文人互动范式，影响后世\"酬唱体\"。本年标志着白居易完全转向\"中隐\"，成为洛阳诗坛核心。"
  },
  {
    "date": "0830-12-23",
    "text": "公元830年12月，白居易担任河南尹，与礼部郎中刘禹锡保持唱和，共同书写洛阳晚年诗篇"
  },
  {
    "date": "0831-01-01",
    "text": "公元831年，白居易儿子崔儿早殇，挚友元稹病逝。遭受丧子、丧友双重打击，白居易诗风更趋沉郁，本年悼亡诗达到唐代五言抒情巅峰，直接影响李商隐无题诗。"
  },
  {
    "date": "0832-01-01",
    "text": "公元832年，白居易荐举贤才李晏、韦楚，并为挚友元稹撰《河南元公墓志铭》"
  },
  {
    "date": "0833-04-25",
    "text": "公元833年，白居易因宦官专权主动退避，辞去河南尹职务，复授太子宾客分司东都。作《罢府归旧居》，标志其政治生涯终结。在这一年，白居易频繁创作悼亡诗，标志其进入暮年文学阶段。"
  },
  {
    "date": "0834-01-01",
    "text": "公元834年，白居易创作内容大多为闲适诗，多与杨汝士、杨虞卿唱和"
  },
  {
    "date": "0835-09-01",
    "text": "公元835年10月，朝廷授同州刺史，白居易坚辞不赴，改授太子少傅分司东都。此年，白居易精选毕生诗文，藏于庐山东林寺，撰《东林寺白氏文集记》。"
  },
  {
    "date": "0836-01-01",
    "text": "公元836年，白居易自编毕生诗文集，藏于洛阳圣善寺律疏院，撰《圣善寺白氏文集记》，开创中国文人系统保存作品的先例。"
  },
  {
    "date": "0837-03-03",
    "text": "公元837年，65岁的白居易娶续弦裴氏。并与裴度、李珏、刘禹锡等十五人修禊洛滨，仿东晋兰亭雅集。"
  },
  {
    "date": "0838-01-01",
    "text": "公元838年，白居易作《醉吟先生传》，以“酒徒、琴侣、诗客、空门友、山水友”五重身份总结晚年生活，结交嵩山僧如满。"
  },
  {
    "date": "0839-02-01",
    "text": "公元839年，白居易将《白氏文集》六十七卷藏于苏州南禅院，确立“三藏分布”体系，开创文人作品多副本传世先例。"
  },
  {
    "date": "0839-10-01",
    "text": "公元839年10月，白居易分别作悼亡诗怀念元稹和裴度。这一年白居易中风，遣散家妓樊素、小蛮"
  },
  {
    "date": "0840-01-01",
    "text": "公元840年，白居易记《香山寺新修藏经堂记》，完成\"诗魔\"向\"香山居士\"的彻底转型。"
  },
  {
    "date": "0841-01-01",
    "text": "公元841年，作《六赞偈》，系统总结晚年佛教思想"
  },
  {
    "date": "0842-01-01",
    "text": "公元842年，70岁的白居易以刑部尚书身份正式退休，结束44年仕途"
  },
  {
    "date": "0844-01-01",
    "text": "公元844年，白居易出钱开挖龙门一带阻碍舟行的石滩，事成后作诗《开龙门八节石滩诗二首并序》留念，诗中仍反映出他“达则兼济天下”的人生观"
  },
  {
    "date": "0846-08-14",
    "text": "公元846年八月，白居易去世于洛阳，享年75岁"
  }
]